tap "caarlos0/tap"
tap "dopplerhq/cli"
tap "goreleaser/tap"
tap "homebrew/aliases"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "knqyf263/pet"
tap "mas-cli/tap"
tap "microsoft/git"
tap "mongodb/brew"
tap "qqilihq/partial-emlx-converter"
# Search tool like grep, but optimized for programmers
brew "ack"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Text processor and publishing toolchain for AsciiDoc
brew "asciidoctor"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Library for command-line editing
brew "readline"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# General-purpose data compression with high compression ratio
brew "xz"
# Fish completion for brew-cask
brew "brew-cask-completion"
# Install RubyGems as Homebrew formulae
brew "brew-gem"
# Bash completion for Bundler
brew "bundler-completion"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# POSIX-compliant descendant of NetBSD's ash (the Almquist SHell)
brew "dash"
# GNU data recovery tool
brew "ddrescue"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Load/unload environment variables based on $PWD
brew "direnv"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Modern replacement for 'ls'
brew "exa"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# GNU database manager
brew "gdbm"
# Library for decimal floating point arithmetic
brew "mpdecimal"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Library and command-line tool for SSH
brew "fabric"
# Bash completion for Fabric
brew "fabric-completion"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Efficient Duplicate File Finder
brew "fclones"
# Simple, fast and user-friendly alternative to find
brew "fd"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Client app of fast reverse proxy to expose a local server to the internet
brew "frpc"
# Command-line fuzzy finder written in Go
brew "fzf"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go Dependency Manager (gdm)
brew "gdm"
# Bash completion for gem
brew "gem-completion"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Open GitHub webpages from a terminal
brew "git-open"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Bash tool for navigation to aliased directories with auto-completion
brew "goto"
# Development kit for the Java programming language
brew "openjdk"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Bash and Zsh completion for Gradle
brew "gradle-completion"
# Colorize logfiles and command output
brew "grc"
# Image manipulation
brew "netpbm"
# Toolkit for creating graphical user interfaces
brew "gtk4"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Command-line benchmarking tool
brew "hyperfine"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Interactive computing in Python
brew "ipython"
# Duplicate file finder and an enhanced fork of 'fdupes'
brew "jdupes"
# JSON output from a shell
brew "jo"
# Platform built on V8 to build network applications
brew "node"
# Note taking and to-do application with synchronization capabilities
brew "joplin-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Bash completion for Launchctl
brew "launchctl-completion"
# Terminal file manager
brew "lf"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Swiss Army Knife for macOS
brew "m-cli"
# Move files and folders to the trash
brew "macos-trash"
# Generates a self-extracting compressed tar archive
brew "makeself"
# Unix documentation system
brew "man-db"
# Mac App Store command-line interface
brew "mas"
# Powerful paging program
brew "most"
# Wrap web apps natively
brew "nativefier"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Port scanning utility for large networks
brew "nmap"
# Node.js version manager
brew "nodebrew"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Adds an OCR text layer to scanned PDF files
brew "ocrmypdf"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Bash completion for Packer
brew "packer-completion"
# Shell command parallelization utility
brew "parallel"
# Search PDFs for strings matching a regular expression
brew "pdfgrep"
# Bash completion for Pip
brew "pip-completion"
# Modern replacement for ps written by Rust
brew "procs"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Bash completion for Rake
brew "rake-completion"
# Ruby version manager
brew "rbenv"
# Utility that provides fast incremental file transfer
brew "rsync"
# Bash completion for Ruby
brew "ruby-completion"
# Safe, concurrent, practical language
brew "rust"
# Bash completion for rustc
brew "rustc-completion"
# Rust toolchain installer
brew "rustup-init"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Command-line tool to manage your ssh connections
brew "stormssh"
# Completion for storm-ssh
brew "stormssh-completion"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Version control system designed to be a better CVS
brew "subversion"
# SVG to PNG converter
brew "svg2png"
# Manipulate and query tags on macOS files
brew "tag"
# User interface to the TELNET protocol
brew "telnet"
# Terminal file explorer
brew "tere"
# Enables extra languages support for Tesseract
brew "tesseract-lang"
# Anonymizing overlay network for TCP
brew "tor"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Manage the desktop wallpaper
brew "wallpaper"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Homebrew, but with Docker images
brew "whalebrew"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# JavaScript package manager
brew "yarn"
# Bash completion for Yarn
brew "yarn-completion"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Additional completion definitions for zsh
brew "zsh-completions"
# Semantic Version Utility
brew "caarlos0/tap/svu"
# The official Doppler CLI for managing your secrets
brew "dopplerhq/cli/doppler"
# nFPM is a simple, 0-dependencies, deb, rpm and apk packager.
brew "goreleaser/tap/nfpm"
# Simple command-line snippet manager
brew "knqyf263/pet/pet"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Convert .emlx and .partial.emlx files created by Apple’s Mail.app to .eml
brew "qqilihq/partial-emlx-converter/partial-emlx-converter"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Inspect application bundles
cask "apparency"
# Application uninstaller
cask "appcleaner"
# Digital signature editor and validator
cask "autofirma"
cask "beardedspice"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Finds duplicate files in a computer system
cask "dupeguru"
# Build desktop apps with JavaScript, HTML, and CSS
cask "electron"
# Bitcoin thin client
cask "electrum"
# Web browser
cask "firefox-developer-edition"
cask "fiscript"
cask "font-archivo-black"
cask "font-jetbrains-mono-nerd-font"
cask "font-lato"
cask "font-nova-mono"
cask "font-share-tech"
cask "font-share-tech-mono"
# Client for the Google Drive storage service
cask "google-drive"
# Java IDE by JetBrains
cask "intellij-idea"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Note taking and to-do application with synchronization capabilities
cask "joplin"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Password manager compatible with KeePass
cask "keeweb"
# File archiver
cask "keka"
# Customize mouse behavior
cask "linearmouse"
# Finder Toolbar app to open the current directory in Terminal or Editor
cask "openinterminal"
# Web browser
cask "opera-developer"
# Image editor
cask "paintbrush"
# IDE for professional Python development
cask "pycharm"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "qlvideo"
# Video chat, voice call and instant messaging application
cask "skype"
# Music streaming service
cask "spotify"
# Quicklook extension for source files
cask "syntax-highlight"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Customizable email client
cask "thunderbird"
# Web browser focusing on security
cask "tor-browser"
# Virtualizer for x86 hardware
cask "virtualbox"
# Extend the functionality of VirtualBox
cask "virtualbox-extension-pack"
# SSH/SFTP/Shell/Telnet/Serial terminal
cask "windterm"
