tap "caarlos0/tap"
tap "dopplerhq/cli"
tap "goreleaser/tap"
tap "homebrew/aliases"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "mas-cli/tap"
tap "microsoft/git"
tap "mongodb/brew"
brew "ack"
brew "asciidoctor"
brew "coreutils"
brew "readline"
brew "asdf"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "brew-cask-completion"
brew "brew-gem"
brew "bundler-completion"
brew "curl"
brew "dash"
brew "deno"
brew "direnv"
brew "duf"
brew "exiftool"
brew "gdbm"
brew "mpdecimal"
brew "xz"
brew "python@3.10", link=true
brew "fabric"
brew "fabric-completion"
brew "fzf"
brew "go"
brew "gdm"
brew "gem-completion"
brew "gh"
brew "git"
brew "gnupg"
brew "openjdk"
brew "gradle"
brew "gradle-completion"
brew "grc"
brew "htop"
brew "httpie"
brew "hyperfine"
brew "ipython"
brew "jq"
brew "launchctl-completion"
brew "python@3.9"
brew "m-cli"
brew "makeself"
brew "man-db"
brew "mas"
brew "most"
brew "node"
brew "nativefier"
brew "ncdu"
brew "neovim", args: ["HEAD"]
brew "nmap"
brew "nodebrew"
brew "openssh"
brew "packer"
brew "packer-completion"
brew "pip-completion"
brew "pyenv"
brew "qpdf"
brew "rake-completion"
brew "rbenv"
brew "rsync"
brew "ruby-completion"
brew "rust"
brew "rustc-completion"
brew "speedtest-cli"
brew "starship"
brew "stormssh"
brew "stormssh-completion"
brew "stow"
brew "telnet"
brew "tor"
brew "tree"
brew "vim"
brew "watchman"
brew "wget"
brew "whalebrew"
brew "yarn"
brew "yarn-completion"
brew "zsh-completions"
brew "caarlos0/tap/svu"
brew "dopplerhq/cli/doppler"
brew "goreleaser/tap/nfpm"
brew "mongodb/brew/mongodb-community"
cask "adobe-acrobat-reader"
cask "adoptopenjdk"
cask "appcleaner"
cask "appcode"
cask "autofirma"
cask "beardedspice"
cask "clion"
cask "datagrip"
cask "docker"
cask "electron"
cask "electrum"
cask "firefox-developer-edition"
cask "font-archivo-black"
cask "font-jetbrains-mono-nerd-font"
cask "font-lato"
cask "font-nova-mono"
cask "font-share-tech"
cask "font-share-tech-mono"
cask "goland"
cask "google-chrome-dev"
cask "intellij-idea"
cask "iterm2"
cask "jetbrains-gateway"
cask "jetbrains-toolbox"
cask "keepingyouawake"
cask "keka"
cask "kekaexternalhelper"
cask "linearmouse"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-word"
cask "opera-developer"
cask "paintbrush"
cask "pycharm"
cask "rubymine"
cask "skype"
cask "slack"
cask "spotify"
cask "telegram-desktop"
cask "thunderbird"
cask "tor-browser"
cask "webstorm"
cask "whatsapp"
mas "Bear", id: 1091189122
mas "HP Smart", id: 1474276998
mas "Magnet", id: 441258766
mas "Userscripts", id: 1463298887
mas "WhatFont", id: 1437138382
